simulations/6aba5190c79659ea5e766a2b/case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  10                                    |
|   \\  /    A nd           | Website:  www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

vertices
(
    (0 0 0)
    (10 0 0)
    (10 8 0)
    (0 8 0)
    (0 0 3)
    (10 0 3)
    (10 8 3)
    (0 8 3)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 80 30) simpleGrading (1 1 1)
);

edges ();

boundary
(
    floor { type wall; faces ((0 1 2 3)); }
    ceiling { type wall; faces ((4 5 6 7)); }
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (2 3 7 6)
            (0 3 7 4)
            (1 2 6 5)
        );
    }
);
