simulations/6aba5190c79659ea5e766a2b/case/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  10                                    |
|   \\  /    A nd           | Website:  www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}

dimensions      [0 2 -3 0 0 0 0];
internalField   uniform 0.086681;

boundaryField
{
    walls { type epsilonWallFunction; value uniform 0.008668; }
    floor { type epsilonWallFunction; value uniform 0.008668; }
    ceiling { type epsilonWallFunction; value uniform 0.008668; }

    inlet_0 { type fixedValue; value uniform 0.866815; }

    outlet_0 { type zeroGradient; }
}
